#include "apilib.h"
#include <stdio.h>

void _main()
{
	int win;/*定义窗口*/
	char buf[360 * 280];/*buf*/
	win = api_openwin(buf, 360, 280, 255, "关于本操作系统");/*标题及窗口大小*/
	api_putstrwin(win, 5/*左右位置*/, 26/*上下位置*/, 0/*颜色:黑*/, 60/*文字宽度*/, "Helo OS 4.1   <issue>    发布版");/*文字内容*/
	api_putstrwin(win, 5/*左右位置*/, 42/*上下位置*/, 0/*颜色:黑*/, 50/*文字宽度*/, "32位操作系统");/*文字内容*/
	api_putstrwin(win, 5/*左右位置*/, 90/*上下位置*/, 0/*颜色:黑*/, 50/*文字宽度*/, "copyright (C) PengZekai");/*文字内容*/
	api_putstrwin(win, 5/*左右位置*/, 130/*上下位置*/, 1/*颜色:红*/, 50/*文字宽度*/, "何乐操作系统 --- 感谢支持！");/*文字内容*/
	api_putstrwin(win, 5/*左右位置*/, 150/*上下位置*/, 4/*颜色:蓝*/, 60/*文字宽度*/, "版权所有，作者对何乐操作系统具有完全解释权。");/*文字内容*/
	for (;;) {
		if (api_getkey(1) == 0x0a) {
			break; /* Enter break; */
		}
	}
	api_end();
}

/********************************
 * 颜色表
 ********************************
 * 0.黑色 * 1.红色 * 2.绿色
 * 3.黄色 * 4.蓝色 * 5.粉红
 * 6.蓝青 * 7.白色 * 8.银白
 * 9.深红 * 10.浅绿 * 11.嫩绿
 * 12.深蓝 * 13.紫色 * 14.青绿
 * 15.浅白
 ********************************
*/